In [1]:
import pandas as pd
import numpy as np
data = pd.Series(['aardvak', 'artichoke', np.nan, 'avocado'])
print(data)
print("\n",data.isnull())

0      aardvak
1    artichoke
2          NaN
3      avocado
dtype: object

 0    False
1    False
2     True
3    False
dtype: bool

In [2]:
data[0]=None
print(data.isnull())

0     True
1    False
2     True
3    False
dtype: bool

In [3]:
from numpy import NaN as NA

data = pd.Series([1, NA, 3.5, NA, 7])
data.dropna()
#print(data)

0    1.0
2    3.5
4    7.0
dtype: float64

In [4]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [5]:
data = pd.DataFrame([[1., 6.5, 3.],[1., NA, NA],[NA, NA, NA],[NA, 6.5,3.]])
cleand= data.dropna()
cleand

     0    1    2
0  1.0  6.5  3.0

In [6]:
data.dropna(how='all')
cleanall = data.dropna(how='all')
print(cleanall)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [7]:
data = pd.DataFrame([[1., 6.5, 3.],[1., NA, NA],[NA, NA, NA],[NA, 6.5,3.]])
cleanall = data.dropna(how='all', axis=1)
print(cleanall)

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [8]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
print(df)
print(df.dropna())
print(df.dropna(thresh=2))

          0         1         2
0  0.556811       NaN       NaN
1 -0.227057       NaN       NaN
2 -1.016377       NaN -0.596641
3  0.683307       NaN  1.173487
4  0.092923 -1.729895 -1.881994
5  0.896967  1.507994 -0.193310
6  1.247809  1.046046  1.278769
          0         1         2
4  0.092923 -1.729895 -1.881994
5  0.896967  1.507994 -0.193310
6  1.247809  1.046046  1.278769
          0         1         2
2 -1.016377       NaN -0.596641
3  0.683307       NaN  1.173487
4  0.092923 -1.729895 -1.881994
5  0.896967  1.507994 -0.193310
6  1.247809  1.046046  1.278769

In [9]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
print(df)
df.fillna(0)

          0         1         2
0  0.014373       NaN       NaN
1  1.146346       NaN       NaN
2 -1.190706       NaN -1.407961
3  0.314412       NaN  1.120239
4  0.210006 -0.390321 -0.745107
5 -0.749639 -0.507976 -2.134473
6  0.951236  0.313463  0.419480

          0         1         2
0  0.014373  0.000000  0.000000
1  1.146346  0.000000  0.000000
2 -1.190706  0.000000 -1.407961
3  0.314412  0.000000  1.120239
4  0.210006 -0.390321 -0.745107
5 -0.749639 -0.507976 -2.134473
6  0.951236  0.313463  0.419480

In [10]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
print(df)
df.fillna({1:0.5,2:0})

          0         1         2
0 -0.155453       NaN       NaN
1  0.931905       NaN       NaN
2  0.634705       NaN -2.241220
3  1.498717       NaN  1.862755
4  1.071324  1.653293 -0.503924
5  0.246456 -0.014769  0.141701
6 -0.743276  1.076508  0.527763

          0         1         2
0 -0.155453  0.500000  0.000000
1  0.931905  0.500000  0.000000
2  0.634705  0.500000 -2.241220
3  1.498717  0.500000  1.862755
4  1.071324  1.653293 -0.503924
5  0.246456 -0.014769  0.141701
6 -0.743276  1.076508  0.527763

In [11]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[:4,1]=NA
df.iloc[:2,2]=NA
_ = df.fillna(0, inplace=True)
print(df)

          0         1         2
0 -0.736866  0.000000  0.000000
1  1.310121  0.000000  0.000000
2 -2.497035  0.000000 -1.724808
3  2.218251  0.000000  2.573816
4  1.825782 -0.660321  1.006862
5  0.878585  0.307405 -0.268748
6  0.072001  1.024581 -0.643702

In [12]:
df = pd.DataFrame(np.random.randn(7, 3))
df.iloc[2:,1]=NA
df.iloc[4:,2]=NA
print(df)
print('*************')
df.fillna(method='ffill')

          0         1         2
0 -0.568019 -0.627497 -0.306534
1  1.627038  0.253400 -0.076262
2 -0.705388       NaN -0.458560
3 -0.144988       NaN -0.044300
4 -0.658781       NaN       NaN
5  1.076960       NaN       NaN
6  0.732277       NaN       NaN
*************

          0         1         2
0 -0.568019 -0.627497 -0.306534
1  1.627038  0.253400 -0.076262
2 -0.705388  0.253400 -0.458560
3 -0.144988  0.253400 -0.044300
4 -0.658781  0.253400 -0.044300
5  1.076960  0.253400 -0.044300
6  0.732277  0.253400 -0.044300

In [13]:
df.fillna(method='ffill',limit=2)

          0         1         2
0 -0.568019 -0.627497 -0.306534
1  1.627038  0.253400 -0.076262
2 -0.705388  0.253400 -0.458560
3 -0.144988  0.253400 -0.044300
4 -0.658781       NaN -0.044300
5  1.076960       NaN -0.044300
6  0.732277       NaN       NaN

In [14]:
data = pd.Series([1, NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

Data Transformation

In [16]:
data = pd.DataFrame({'k1': ['one','two']*3+['two'],'k2':[1,1,2,3,3,4,4]})
print(data)
data.duplicated()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [18]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [28]:
data.drop_duplicates(['k1','k2'], keep ='last')

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
6  two   4

In [29]:
data = pd.DataFrame({
    'food': ['bacon', 'pulled pork', 'bacon', 'Pastrami', 'corned beef', 'Bacon', 'pastrami', 'honey ham', 'nova lox'], 
     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]
    })
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [30]:
meat_to_animal = {
'bacon': 'pig',
'pulled pork': 'pig',
'pastrami': 'cow',
'corned beef': 'cow',
'honey ham': 'pig',
'nova lox': 'salmon'
}

In [31]:
lowercased = data['food'].str.lower()
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [32]:
data['animal'] = lowercased.map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [33]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [34]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [35]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
xd = data.replace([-999, -1000], np.nan)
xd

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [36]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data.replace([-999, -1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [37]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [38]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), 
                    index=['Ohio', 'Colorado', 'New York'], 
                    columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [43]:
transform = lambda x: x[:4].upper()
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [47]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [41]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), 
                    index=['Ohio', 'Colorado', 'New York'], 
                    columns=['one', 'two', 'three', 'four'])
data.rename(index=str.title, columns=str.upper)

          ONE  TWO  THREE  FOUR
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [48]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), 
                    index=['Ohio', 'Colorado', 'New York'], 
                    columns=['one', 'two', 'three', 'four'])

data.rename(index= {'Ohio': 'INDIANA'}, columns={'three': 'peekaboo'})

          one  two  peekaboo  four
INDIANA     0    1         2     3
Colorado    4    5         6     7
New York    8    9        10    11

In [49]:
data = pd.DataFrame(np.arange(12).reshape((3, 4)), 
                    index=['Ohio', 'Colorado', 'New York'], 
                    columns=['one', 'two', 'three', 'four'])
data.rename(index={'Ohio': 'INDIANA'}, inplace=True)
data

          one  two  three  four
INDIANA     0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11